zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
/*
 * Callback function usr_mlme_rx_enable_conf
 *
 * @param status           Result of requested receiver enable operation.
 *
 * @return void
 */
void usr_mlme_rx_enable_conf(uint8_t status)
{
}

#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */

#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      ||	\
	(MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
	(MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
	(MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))

/*
 * @brief Callback function usr_mlme_scan_conf
 *
 * @param status            Result of requested scan operation
 * @param ScanType          Type of scan performed
 * @param ChannelPage       Channel page on which the scan was performed
 * @param UnscannedChannels Bitmap of unscanned channels
 * @param ResultListSize    Number of elements in ResultList
 * @param ResultList        Pointer to array of scan results
 */
void usr_mlme_scan_conf(uint8_t status,
		uint8_t ScanType,
		uint8_t ChannelPage,
		uint32_t UnscannedChannels,
		uint8_t ResultListSize,
		void *ResultList)
{
	if (status == MAC_SUCCESS) {
		wpan_pandescriptor_t *coordinator;
		uint8_t i;

		/*
		 * Analyze the ResultList.
		 * Assume that the first entry of the result list is our
		 *coodinator.
		 */
		coordinator = (wpan_pandescriptor_t *)ResultList;

		for (i = 0; i < ResultListSize; i++) {
			/*
			 * Check if the PAN descriptor belongs to our
			 *coordinator.
			 * Check if coordinator allows association.
			 */
			if ((coordinator->LogicalChannel == current_channel) &&
					(coordinator->ChannelPage ==
					current_channel_page) &&
					(coordinator->CoordAddrSpec.PANId ==
					DEFAULT_PAN_ID) &&
					((coordinator->SuperframeSpec &
					((uint16_t)1 <<
					ASSOC_PERMIT_BIT_POS)) ==
					((uint16_t)1 << ASSOC_PERMIT_BIT_POS))
					) {
				/* Store the coordinator's address information.
				 **/
				coord_addr_spec.AddrMode = WPAN_ADDRMODE_SHORT;
				coord_addr_spec.PANId = DEFAULT_PAN_ID;
				ADDR_COPY_DST_SRC_16(
						coord_addr_spec.Addr.short_address,
						coordinator->CoordAddrSpec.Addr.short_address);
#ifdef SIO_HUB
				printf("Found network\r\n");
#endif

				/* Set proper state of application. */
				app_state = APP_SCAN_DONE;

				/*
				 * Set the PAN-Id of the scanned network.
				 * This is required in order to perform a proper
				 *sync
				 * before assocation.
				 * Use: bool wpan_mlme_set_req(uint8_t
				 *PIBAttribute,
				 *                             void
				 **PIBAttributeValue);
				 *
				 * This request leads to a set confirm message
				 *-> usr_mlme_set_conf
				 */
				uint16_t pan_id;
				pan_id = DEFAULT_PAN_ID;
				wpan_mlme_set_req(macPANId,
#ifdef MAC_SECURITY_ZIP				
				NO_PIB_INDEX, 
#endif				
				&pan_id);
				
				return;
			}

			/* Get the next PAN descriptor. */
			coordinator++;
		}

		/*
		 * If here, the result list does not contain our expected
		 *coordinator.
		 * Let's scan again.
		 */
		wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
				SCAN_CHANNEL,
				SCAN_DURATION_SHORT,
				current_channel_page);
	} else if (status == MAC_NO_BEACON) {
		/*
		 * No beacon is received; no coordiantor is located.
		 * Scan again, but used longer scan duration.
		 */
		wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
				SCAN_CHANNEL,
				SCAN_DURATION_LONG,
				current_channel_page);
	} else {
		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}

	/* Keep compiler happy. */
	ScanType = ScanType;
	ChannelPage = ChannelPage;
	UnscannedChannels = UnscannedChannels;
}

#endif

/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */
#ifdef MAC_SECURITY_ZIP
void usr_mlme_set_conf(uint8_t status, uint8_t PIBAttribute, uint8_t PIBAttributeIndex)
{
    if (status != MAC_SUCCESS)
    {
        // something went wrong; restart
        wpan_mlme_reset_req(true);
    }
    else
    {
        switch (PIBAttribute)
        {
            case macPANId:
            {
				/*
				 * Set the Coordinator Short Address of the scanned network.
				 * This is required in order to perform a proper sync
				 * before assocation.
				 */
				wpan_mlme_set_req(macCoordShortAddress,			
				NO_PIB_INDEX, 
				&coord_addr_spec.Addr);
				
			}
            break;

            case macCoordShortAddress:
                 {
					wpan_mlme_sync_req(current_channel,
							current_channel_page,
							1);
                }
                 break;

            case macDefaultKeySource:
                 {
	                 uint8_t mac_sec_level_table_entries = 1;

	                 wpan_mlme_set_req(macSecurityLevelTableEntries,
	                 NO_PIB_INDEX,
	                 &mac_sec_level_table_entries);
                 }
                 break;

             case macSecurityLevelTableEntries:
                 {
	                 uint8_t mac_sec_level_table[4] = {FRAME_TYPE_DATA,      // FrameType: Data
		                 CMD_FRAME_ID_NA,      // CommandFrameIdentifier: N/A
		                 ZIP_SEC_MIN,          // SecurityMinimum: 5
		                 DEV_OVERRIDE_SEC_MIN  // DeviceOverrideSecurityMinimum: True
	                 };

	                 wpan_mlme_set_req(macSecurityLevelTable,
	                 0,    // Index: 0
	                 &mac_sec_level_table);
                 }
                 break;

             case macSecurityLevelTable:
                 {
	               uint8_t mac_key_table_entries = 3;

	                 wpan_mlme_set_req(macKeyTableEntries,
	                 NO_PIB_INDEX,
	                 &mac_key_table_entries);
                 }
                 break;

             case macKeyTableEntries:
                 {
	                                    uint8_t mac_key_table[40] =
	                                    {
		                                    // KeyIdLookupList[1].LookupData : macDefaultKeySource || g_Sec_KeyIndex_1
		                                    default_key_source[0], // LookupData[0]
		                                    default_key_source[1], // LookupData[1]
		                                    default_key_source[2], // LookupData[2]
		                                    default_key_source[3], // LookupData[3]
		                                    default_key_source[4], // LookupData[4]
		                                    default_key_source[5], // LookupData[5]
		                                    default_key_source[6], // LookupData[6]
		                                    default_key_source[7], // LookupData[7]
		                                    KEY_INDEX_1,           // LookupData[8]
		                                    LOOKUP_DATA_SIZE_1, // LookupDataSize: 0x01 : Size 9 octets
		                                    1,              // KeyIdLookupListEntries = 1
		                                    // KeyDeviceList[1]
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    MAC_ZIP_MAX_KEY_DEV_LIST_ENTRIES,              // KeyDeviceListEntries
		                                    //  KeyUsageList
		                                    FRAME_TYPE_DATA,    // FrameType - Data frames
		                                    CMD_FRAME_ID_NA,    // CommandFrameIdentifier not used in ZIP
		                                    1,                  // KeyUsageListEntries
		                                    // Key
		                                    default_key[0][0],
		                                    default_key[0][1],
		                                    default_key[0][2],
		                                    default_key[0][3],
		                                    default_key[0][4],
		                                    default_key[0][5],
		                                    default_key[0][6],
		                                    default_key[0][7],
		                                    default_key[0][8],
		                                    default_key[0][9],
		                                    default_key[0][10],
		                                    default_key[0][11],
		                                    default_key[0][12],
		                                    default_key[0][13],
		                                    default_key[0][14],
		                                    default_key[0][15],
	                                    };
	                                    uint8_t mac_key_table1[40] =
	                                    {
		                                    // KeyIdLookupList[1].LookupData : macDefaultKeySource || g_Sec_KeyIndex_1
		                                    default_key_source[0], // LookupData[0]
		                                    default_key_source[1], // LookupData[1]
		                                    default_key_source[2], // LookupData[2]
		                                    default_key_source[3], // LookupData[3]
		                                    default_key_source[4], // LookupData[4]
		                                    default_key_source[5], // LookupData[5]
		                                    default_key_source[6], // LookupData[6]
		                                    default_key_source[7], // LookupData[7]
		                                    KEY_INDEX_2,           // LookupData[8]
		                                    LOOKUP_DATA_SIZE_1, // LookupDataSize: 0x01 : Size 9 octets
		                                    1,              // KeyIdLookupListEntries = 1
		                                    // KeyDeviceList[1]
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    MAC_ZIP_MAX_KEY_DEV_LIST_ENTRIES,              // KeyDeviceListEntries
		                                    //  KeyUsageList
		                                    FRAME_TYPE_DATA,    // FrameType - Data frames
		                                    CMD_FRAME_ID_NA,    // CommandFrameIdentifier not used in ZIP
		                                    1,                  // KeyUsageListEntries
		                                    // Key
		                                    default_key[1][0],
		                                    default_key[1][1],
		                                    default_key[1][2],
		                                    default_key[1][3],
		                                    default_key[1][4],
		                                    default_key[1][5],
		                                    default_key[1][6],
		                                    default_key[1][7],
		                                    default_key[1][8],
		                                    default_key[1][9],
		                                    default_key[1][10],
		                                    default_key[1][11],
		                                    default_key[1][12],
		                                    default_key[1][13],
		                                    default_key[1][14],
		                                    default_key[1][15],
	                                    };
	                                    uint8_t mac_key_table2[40] =
	                                    {
		                                    // KeyIdLookupList[1].LookupData : macDefaultKeySource || g_Sec_KeyIndex_1
		                                    default_key_source[0], // LookupData[0]
		                                    default_key_source[1], // LookupData[1]
		                                    default_key_source[2], // LookupData[2]
		                                    default_key_source[3], // LookupData[3]
		                                    default_key_source[4], // LookupData[4]
		                                    default_key_source[5], // LookupData[5]
		                                    default_key_source[6], // LookupData[6]
		                                    default_key_source[7], // LookupData[7]
		                                    KEY_INDEX_3,           // LookupData[8]
		                                    LOOKUP_DATA_SIZE_1, // LookupDataSize: 0x01 : Size 9 octets
		                                    1,              // KeyIdLookupListEntries = 1
		                                    // KeyDeviceList[1]
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    EMPTY_DEV_HANDLE,              // DeviceDescriptorHandle
		                                    false,              // UniqueDevice - Key is unique per node
		                                    false,              // Blacklisted
		                                    MAC_ZIP_MAX_KEY_DEV_LIST_ENTRIES,              // KeyDeviceListEntries
		                                    //  KeyUsageList
		                                    FRAME_TYPE_DATA,    // FrameType - Data frames
		                                    CMD_FRAME_ID_NA,    // CommandFrameIdentifier not used in ZIP
		                                    1,                  // KeyUsageListEntries
		                                    // Key
		                                    default_key[2][0],
		                                    default_key[2][1],
		                                    default_key[2][2],
		                                    default_key[2][3],
		                                    default_key[2][4],
		                                    default_key[2][5],
		                                    default_key[2][6],
		                                    default_key[2][7],
		                                    default_key[2][8],
		                                    default_key[2][9],
		                                    default_key[2][10],
		                                    default_key[2][11],
		                                    default_key[2][12],
		                                    default_key[2][13],
		                                    default_key[2][14],
		                                    default_key[2][15],
	                                    };
	                                    wpan_mlme_set_req(macKeyTable,
	                                    INDEX_0,    // Index: 0
	                                    &mac_key_table);

